In [1]:
import pandas as pd

##### a.Read data from csv file fire department of New York City (FDNY)

In [2]:
fdny_data = pd.read_csv('FDNY.csv')

##### b.View content of the data

In [3]:
display(fdny_data)

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
...,...,...,...
214,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
215,Engine 167/Ladder 87,345 Annadale Road,Staten Island
216,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
217,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
218,Engine 151/Ladder 76,7219 Amboy Road,Staten Island

In [4]:
fdny_data.isnull().sum()

FacilityName       0
FacilityAddress    0
Borough            0
dtype: int64

#### c.View first five records

In [5]:
fdny_data.head()

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan

#### d.Skip the first row from dataset

In [6]:
fdny_data.drop([0], axis = 0, inplace = True)

#### e.View first five records from fixed dataset

In [7]:
fdny_data.head()

,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
5,Ladder 8,14 North Moore Street,Manhattan

#### f.Show statistics of dataset.

In [18]:
fdny_data.describe()

              FacilityName  FacilityAddress   Borough
count                  218              218       218
unique                 218              218         5
top     Engine 4/Ladder 15  42 South Street  Brooklyn
freq                     1                1        66

#### g. Display columns of the dataset

In [8]:
fdny_data.columns

Index(['FacilityName', 'FacilityAddress', 'Borough'], dtype='object')

In [9]:
fdny_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 1 to 218
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     218 non-null    object
 1   FacilityAddress  218 non-null    object
 2   Borough          218 non-null    object
dtypes: object(3)
memory usage: 5.2+ KB

#### h. Datatypes of each column

In [10]:
fdny_data.dtypes

FacilityName       object
FacilityAddress    object
Borough            object
dtype: object

#### i. index column

In [11]:
fdny_data.index

RangeIndex(start=1, stop=219, step=1)

#### j. Find the total number of fire department facilities in New York city

In [12]:
fdny_data['FacilityName'].unique().size

218

#### k.View FDNY information for each borough.

In [13]:
fdny_data['Borough'].value_counts()

Brooklyn         66
Queens           50
Manhattan        48
Bronx            34
Staten Island    20
Name: Borough, dtype: int64

In [14]:
fdny_data.groupby(['Borough']).describe()

              FacilityName         \
                     count unique
Borough
Bronx                   34     34
Brooklyn                66     66
Manhattan               48     48
Queens                  50     50
Staten Island           20     20

                                                                       \
                                                             top freq
Borough
Bronx                           Engine 60/Ladder 17/Battalion 14    1
Brooklyn       Engine 207/Ladder 110/Battalion 31/Division 11...    1
Manhattan                                     Engine 4/Ladder 15    1
Queens                                     Engine 258/Ladder 115    1
Staten Island                                           Marine 9    1

              FacilityAddress
                        count unique                          top freq
Borough
Bronx                      34     34        341 East 143rd Street    1
Brooklyn                   66     66           172 Tillary Street    1
Manhattan                  48     48              42 South Street    1
Queens                     50     50            10-40 47th Avenue    1
Staten Island              20     20  Saint George Ferry Terminal    1

#### l .Find the total number of fire department facilities in each borough.(Use groupby)

In [15]:
fdny_data.groupby(['Borough']).size()

Borough
Bronx            34
Brooklyn         66
Manhattan        48
Queens           50
Staten Island    20
dtype: int64

#### m.Find total number of fire department facilities in Manhattan (use groupby)

In [1]:
fdny_data['Borough'].groupby([by = 'Manhattan'])

SyntaxError: invalid syntax (4276934852.py, line 1)

#### n.Clean the dataset and drop null/nan value.

In [17]:
fdny_data.dropna(inplace = True)
fdny_data

,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
5,Ladder 8,14 North Moore Street,Manhattan
...,...,...,...
214,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
215,Engine 167/Ladder 87,345 Annadale Road,Staten Island
216,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
217,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
218,Engine 151/Ladder 76,7219 Amboy Road,Staten Island